def print_star_digits():
    star_digits = {
        '0': [
            '  ***  ',
            ' *   * ',
            '*     *',
            '*     *',
            '*     *',
            ' *   * ',
            '  ***  '
        ],
        '1': [
            '   *   ',
            '  **   ',
            ' * *   ',
            '   *   ',
            '   *   ',
            '   *   ',
            ' ***** '
        ],
        '2': [
            '  ***  ',
            ' *   * ',
            ' *  *  ',
            '   *   ',
            '  *    ',
            ' *     ',
            ' ***** '
        ],
        '3': [
            ' ***** ',
            '     * ',
            '     * ',
            '  **** ',
            '     * ',
            '     * ',
            ' ***** '
        ],
        '4': [
            '    *  ',
            '   **  ',
            '  * *  ',
            ' *  *  ',
            '*******',
            '    *  ',
            '    *  '
        ],
        '5': [
            ' ***** ',
            ' *     ',
            ' *     ',
            ' ***** ',
            '     * ',
            '     * ',
            ' ***** '
        ],
        '6': [
            '  ***  ',
            ' *     ',
            ' *     ',
            ' ****  ',
            ' *   * ',
            ' *   * ',
            ' ****  '
        ],
        '7': [
            ' ***** ',
            '     * ',
            '    *  ',
            '   *   ',
            '  *    ',
            ' *     ',
            '*      '
        ],
        '8': [
            ' ***** ',
            '*     *',
            '*     *',
            ' ***** ',
            '*     *',
            '*     *',
            ' ***** '
        ],
        '9': [
            ' ***** ',
            '*    * ',
            '*    * ',
            ' ***** ',
            '     * ',
            '     * ',
            ' ***** '
        ]
    }
    numbers = input("Введите трёхзначное, двухзначное число (цифры пишите через пробел): ").split()
    output = ["", "", "", "", "", "", ""]
    for number in numbers:
        if number in star_digits:
            for i, line in enumerate(star_digits[number]):
                output[i] += line + " "
    for line in output:
        print(line)

print_star_digits()
